

        //Переменные - что такое, зачем нужны
// const, let
// способы объявления и присваивания
// какие имена можно использовать, регистр

const pi = 3.14;
// pi = 5; // нельзя
// let a;
// let b;
// let c;
// let d;
let a, b = 10, c, d;





        //Типы данных
// string
// number - infinity, NaN
// boolean
// null
// Object
// undefined
// Symbol
// BigInt




        //String
// кавычки, перенос строк, escape последовательность
let text1 = "Text 1";
let text2 = 'Text 2';
let text3 = `Text 
1`;


        //Number 
// Number - положит/отрицат, целые/дроби. infinity, NaN
a = -10;



// console.log(typeof(1 / 0)); 
// console.log(typeof("a" / 20)); 


        // undefined
let stroka;
console.log(typeof(stroka));

        //boolean - true/false


        //null
let strokaNull = null;
typeof(strokaNull);
typeof strokaNull;


        // Преобразования типов

    // в число
let strToNumb = "1";
console.log(typeof(strToNumb), strToNumb);
strToNumb = Number(strToNumb);
// способ 1
console.log("Из строки в число "+strToNumb + typeof(strToNumb));

// strToNumb = "5"
//способ 

//варианты с другими типами


    //в строку
let numToStr = 100;
//вариант 1
numToStr = String(numToStr)

// numToStr = 500;
//вариант 2
// console.log(typeof(""+numToStr), numToStr);

// let bool = false;

    // в boolean
// let bool2 = "true";




        //Арифметические операторы
// Сложение +, Вычитание -, Умножение *, 
// Деление /, Взятие остатка от деления %, Возведение в степень **.




a = "30", b = 40;
// !!!!!!!!!Если хотя бы один аргумент является строкой, то второй тоже будет преобразован к строке
// !!!!!!!!!Остальные операторы всегда работают только с числами и приводят к числу


c = b + a; // "4030"
console.log(c);
c = b / a; // 40 / 30
console.log(c);
c = b - a; // 40 - 30
console.log(c);
c = b * a; // 40 * 30
console.log(c);
a = 5 , b = 2;
console.log(a % b); // 5 % 2 = 1
console.log(a ** b); // 5^2 = 25








// Сокращенные формы
i = i + 3;  i += 3;
i = i - 3;  i -= 3;
i = i * 3;  i *= 3;
i = i / 3;  i /= 3;



// alert("Сообщение");
// confirm("Вы хотите уйти с сайта?")
// prompt("Введите свой возраст","");
//проверить в консоли разные варианты



// Создайте переменную str и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран.




//  Создайте переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных выведите на экран фразу 'Привет, Мир!'.



// Спросите имя пользователя с помощью методы prompt. Выведите с помощью alert сообщение 'Ваше имя %имя%'.





//  Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'.




//  Спросите у пользователя число. Выведите с помощью alert квадрат этого числа.



/*Создайте две переменные. Поместите в них переменную **`count`** и превратите в строку, а **`userName`** наоборот в число. Попробуйте реализовать задачу двумя разными способами. */


// Создайте переменную str и присвойте ей значение 'abcde'. Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.





//  Создайте переменную num и присвойте ей значение '12345'. Найдите произведение (умножение) цифр этого числа.



































